Repository: common-repository/payplug-payments
Catalog: languages/payplug-*.po
Languages: fr_fr

source: for developpers, use static method <br><code>&lt;?php PAYPLUG_Plugin::payplug_generate_payment_link( price, 'Button text', 'CSS class' , 'Icon', 'Order id', 'Custom data', 'test@test.com', 'firstname', 'lastname' ); ?&gt;</code>
fr_fr: pour les developpeurs, utiliser la méthode static PAYPLUG_Plugin::payplug_generate_payment_link( price, 'Button text', 'CSS class' , 'Icon', 'Order id', 'Custom data', 'email@email.com', 'Firstname', 'Lastname' ); ?&gt;</code>

source: Settings
fr_fr: Paramètres

source: Integrate online payment on your website in 1 minute.
fr_fr: Intégrez le paiement en ligne sur votre site en 1 minute.

source: <b>2,5% per transaction + 0,25 €</b>.<br/>Your client doesn't have to account to pay.
fr_fr: <b>2,5% par transaction + 0,25 €</b>.<br/>Votre client n'a pas besoin de compte pour payer.

source: Create free account
fr_fr: Créer un compte gratuitement

source: Learn more about PayPlug
fr_fr: En savoir plus sur PayPlug

source: Once configured, 3 ways to generate a payment button PayPlug :
fr_fr: Une fois configuré, 3 façons de générer le bouton de paiement Payplug

source: use the shortcode <br><code>[payplug price="xx.xx" title_button="Buy" class="payplug_buy_button my_class" icon="glyphicon" order_id="order_id" custom_data="custom_data" email="test@test.com" first_name="firstname" last_name="lastname" ]</code>
fr_fr: utiliser le shortcode <br><code>[payplug price="xx.xx" title_button="Buy" class="payplug_buy_button my_class" icon="glyphicon" order_id="order_id" custom_data="custom_data" email="test@test.com" first_name="firstname" last_name="lastname"]</code>

source: use the Payplug widget
fr_fr: utiliser le widget Payplug

source: Login PayPlug
fr_fr: Identifiant PayPlug

source: Password PayPlug
fr_fr: Mot de passe PayPlug

source: Payplug TEST mode ?
fr_fr: Payplug en mode TEST ?

source: IPN (Instant Payment Notification) URL
fr_fr: URL de l’IPN (Instant Payment Notification)

source: Return URL
fr_fr: URL de retour

source: Allow Usage Tracking ?
fr_fr: Autoriser l'utilisation du suivi ?

source: Allow Plateforme WP Digital to anonymously track how this plugin is used and help us make the plugin better.
fr_fr: Autoriser Plateforme WP Digital à suivre de manière anonyme l’utilisation de l’extension et ainsi nous aider à l’améliorer.

source: The login and password are mandatory
fr_fr: Le login et le mot de passe sont obligatoires

source: Your login and/or password PayPlug are incorrect
fr_fr: Votre login et/ou votre mot de passe PayPlug sont incorrects

source: PayPlug error
fr_fr: Erreur PayPlug

source: Changes saved
fr_fr: Modifications sauvegardées

source: Unable to generate the shortcode PayPlug, thank you to verify the configuration PayPlug
fr_fr: Impossible de générer le shortcode PayPlug, merci de vérifier la configuration PayPlug

source: Buy
fr_fr: Acheter

source: Allow
fr_fr: Autoriser

source: Do not allow
fr_fr: Ne pas autoriser

source: OpenSSL must be enabled to run PayPlug
fr_fr: OpenSSL doit être activé pour faire fonctionner PayPlug

source: Add button payment PayPlug.
fr_fr: Ajouter bouton paiement PayPlug.

source: Button title
fr_fr: Titre du bouton

source: Price
fr_fr: Prix

source: CSS Class
fr_fr: Classe CSS

source: Icon
fr_fr: Icône
